[
{"comment": ["Web definitions: A decentralised digital currency created in 2009; A client for the above currency."]},
{"comment": ["I always watch this video everytime I forgot what bitcoin is. Nice post. Thanks!"]},
{"comment": ["Awesome info thanks "]},
{"comment": ["It's actually turning out to be a great way to invest, believe it or not. It's like watching the stocks go up and down every day. Keeps me on my toes."]},
{"comment": ["I wrote an article about it:"]},
{"comment": ["Great article!! Really nice insights. I think some people struggle with claiming bitcoin as a currency because it's not something that they can \"hold.\" We can hold dollars and coins. Of course, the newest generation won't have any prob seeing btc as a currency since everything is digital to them as it is -- they don't know any different. "]},
{"comment": ["This virtual currency, designed in 2008 by a person with the pseudonym Satoshi Nakamoto to be taken anywhere, anytime, is uncontrolled by any banking system, send money to another country instead take many hours it will take a few moments. You can be exchanged for other currencies, or with the help of a special program to kick bitcoiny, need a good graphics card."]},
{"comment": [null]},
{"comment": ["Awesome info thanks "]},
{"comment": ["Nice information thank you."]},
{"comment": [null]},
{"comment": [null]},
{"comment": ["great info and links, thanks for sharing"]},
{"comment": ["This videos is good for newbies..."]},
{"comment": [" might be a bit complicated for some, and they might find it hard to understand how it works. Here is a simplified illustration from "]},
{"comment": ["First time i see the video..."]},
{"comment": [null]},
{"comment": ["Yes, Bitcoin is our next step and sooner or later financial institutions will have to either admit it and deal with BTC or lose great chances to get more profit."]},
{"comment": ["Bitcoin is the greatest online currency with no fees involved where you can trade money to people in an instant! It is also a great site as there are also many ways to make money with bitcoin and it is like a savings account, making your money stored in it go up!!!AMAZING "]},
{"comment": ["Bitcoin is simply \"The Future of Money\"!"]},
{"comment": ["That illustration really would help newbie to understand what bitcoin is."]},
{"comment": ["Bitcoin is \"The Future of Money\".  And that's just it's first \"app\"!"]},
{"comment": ["this information is verified ?"]},
{"comment": ["none of the videos ppl are referencing are showing up for me? is it just me or were they removed. thx"]},
{"comment": ["I like this video very much its very nice. I learned lot of information from this post. Thanks for sharing."]},
{"comment": ["Bitcoin can be used to buy things electronically. In that sense, it’s like conventional dollars, euros, or yen, which are also traded digitally."]},
{"comment": ["Really good info to share with less Bitcoin-savvy individuals."]},
{"comment": [null]},
{"comment": ["Hello Friend,"]},
{"comment": ["Bitcoin is a currency, although digital, qualifies it for trading. It can be held, bought, traded, invested or stolen. The most extensively circulated cryptocurrency, originated in 2009 by someone (or some people) using the pseudonym Satoshi Nakamoto. It is produced by the process of “mining”, essentially using a computer’s processing power to work out intricate algorithms called “blocks.” Miners earn about25 Bitcoins once block is decrypted. This relies on GPU power. Another method of trading, is to basically exchanging fiat currency at a Bitcoin exchange."]},
{"comment": ["Bitcoin is a nothing but a from of digital currency.it is created and held electronically and no one controls it.Here is "]},
{"comment": ["thanks for sharintg"]},
{"comment": ["Thanks for sharing this thread from this I came to know what Bitcoin is."]},
{"comment": ["Hi guys,"]},
{"comment": ["Bitcoin is the future "]},
{"comment": ["I know this forum is dedicated to Bitcoin, however does anyone know if this new Bitgold can be held in on paper wallets in the same way that bitcoin can be held on paper for security. I called the Bitgold support and they had no idea what cold storage or paper wallets were to the digital currency world."]},
{"comment": [null]},
{"comment": ["Thanks for the post "]},
{"comment": ["  "]},
{"comment": [null]},
{"comment": ["news bitcoin   newbielink:http://www.mycoincapital.com "]},
{"comment": ["bitcoin is simply the king of currency"]},
{"comment": ["I am looking into the business of bitcoin!"]},
{"comment": ["I don't want to tell you what is Bitcoin. Just I want to tell you it's so important how you gonna get familiar with bitcoin. "]},
{"comment": ["BTC is digital currency and I am currently using it with my anx account~"]},
{"comment": ["It is  basically a digital currency, which would be traded."]},
{"comment": ["if you're interested. I suggest you to check out this year's Cloud Asia Expo for the lastest development."]},
{"comment": ["I am already in. cannot wait to be there."]},
{"comment": ["Bitcoin works via something called the blockchain. Every time you do a transaction, it gets included in a block (which is all the recent transactions bundled together) and every 10 minutes or so, that new block gets accepted into the stack of blocks called the blockchain. So that's how it works every 10 minutes the whole network breathes, and updates network wide with the new block of transactions. Mining serves the purpose of verifiying these new blocks."]},
{"comment": [null]},
{"comment": ["Great article!! Really nice insights. I think some people struggle with claiming bitcoin as a currency because it's not something that they can \"hold.\" We can hold dollars and coins. Of course, the newest generation won't have any prob seeing btc as a currency since everything is digital to them as it is -- they don't know any different."]},
{"comment": ["It's a great pleasure to hear your share and learn a lot."]},
{"comment": ["Bitcoin is one of those things that's really hard to explain what it is to someone, but it's easy to use.."]},
{"comment": ["[/size][/font][/color]"]},
{"comment": ["Thanks for this information! I hope it can help. "]},
{"comment": ["Bitcoin is a freedom of choice"]},
{"comment": ["Thank you for the info."]},
{"comment": ["We have carefully studied the Bitcoin client inside and found almost imperceptible, but very significant flaw (connected with the commission), using it, we made a deal Bitcoin, in which the recipient has received more than Bitcoin sender sent. Unfortunately, the difference is not so great (about 1%), and if you do only one transaction for a small amount, then your capital does not increase by much, but if you do the deal constantly with a lot of, you can get rich very quickly. We discovered this flaw recently and have not yet managed to win a lot, but every day we multiply our money a hundred times and we want to make it more reliable. We all understand that such freebies can not last long, and most likely this will be found and corrected in the near future, but until that happens, we want to win as much as possible."]},
{"comment": ["This infographic is great! Thanks!"]},
{"comment": ["As per Bitcoin Wikipedia "]},
{"comment": ["thanks"]},
{"comment": ["Bitcoin is a consensus network that enables a new payment system and a completely digital money. It is the first decentralized peer-to-peer payment network that is powered by its users with no central authority or middlemen. From a user perspective, Bitcoin is pretty much like cash for the Internet. Bitcoin can also be seen as the most prominent triple entry bookkeeping system in existence."]},
{"comment": [null]},
{"comment": ["For quick understanding, consider Bitcoins as Coins in the form of bits (010101.......). Yes it is a digital currency with a promising future."]},
{"comment": ["Bitcoin is both a cryptocurrency and an electronic payment system invented by an unidentified programmer, or group of programmers, under the name of Satoshi Nakamoto"]},
{"comment": ["I always watch this video everytime I forgot what bitcoin is."]},
{"comment": ["Basically bitcoin is a digital currency that become success of so far and as we all know digital or virtual this isn't like a physical money and bitcoin can only be stored in your bitcoin wallet .Bitcoin as we all know was made by Satoshi Nakamoto but never been confirmed who is this person or is he really the maker of bitcoin."]},
{"comment": ["I still don't understand completely how crypto currencies work"]},
{"comment": ["The blockchain has so much potential. Not just for financial services, but digital assets of all kinds. "]},
{"comment": ["Hey it's really cool.. I heard from my friend about this bitcoin, later even m using it and I'm getting usefull from this bitcoin.. Thanks a lot.."]},
{"comment": ["I Have a passion for the Crypto world and have decided to open up an advising firm. Please help me and my family along this journey. "]},
{"comment": ["Have extra bitcoins? Try out gambling with bitcoins at avsbsports.eu!"]},
{"comment": ["I think it is a form of cybercurrency."]},
{"comment": ["Bitcoin has tremendous ultra potential value."]},
{"comment": ["Crypto currency bitcoin is an excellent tool for making money. A very important factor is the place of its storage. I have been working with Bitcoin for a long time, and I recommend the wallet "]},
{"comment": ["hahahahah"]},
{"comment": ["Bitcoin is a type of cryptocurrency. It is one of the first digital currencies to use peer-to-peer (P2P) technology to facilitate instant payments. It is a user as well as a tech-friendly digital currency and thus public can access it easily. Nobody owns or controls Bitcoin."]},
{"comment": [null]},
{"comment": ["I have got a very good article for all the newbies, "]},
{"comment": ["Bitcoin is a type of digital currency in which encryption techniques are used to generate digital currency. To know more about blockchain apps and software, visit the Draglet website."]},
{"comment": ["Very nice store "]},
{"comment": ["I am a newbie on Bitcoin field! I have a question as a new member. So there was something going on between Bitcoin and Segwit? on August 1th?? can anyone tell me what was it about?"]},
{"comment": ["I have actually no idea about segwit but i know about Bitcoin."]},
{"comment": ["Friends, I want to recommend you a great online store "]},
{"comment": ["Bitcoin is basically a digital crypto-currency that can be earned by variety of ways. In ancient times, mining of Bitcoins was done by using various network of computers from around the world. But now a days, with the enhancement in crypto world, bitcoins are mined effectively with easy and fair way."]},
{"comment": ["Thank you for the video. How can i get my first coins? "]},
{"comment": ["BITCOIN is a digital money of course..lol"]},
{"comment": ["Thanks for the information as i was looking for ways on how i can earn the free bitcoins."]},
{"comment": ["-BUY AND SELL Bitcoin with ease. An escrow system that guarantees safety"]},
{"comment": ["Отличный пост, спасибо)"]},
{"comment": ["Guys, did you hear about the coin that will be lunching?"]},
{"comment": ["Bitcoins are completely virtual coins designed to be self contained for their value with no needs for bank to move and store the money. Once you have bitcoin, they behave like physical gold coins, they possess value and trade if they were nuggets of gold in your wallet/pocket. You can use your bitcoins to buy goods, items and pay bills."]},
{"comment": ["Learned a lot for a newbie like me. Many thanks. "]},
{"comment": ["good explanations"]},
{"comment": ["DO YOU KNOW YOU CAN MAKE 0.7btc in just 48HOURS?"]},
{"comment": ["Thank you for these hreat discussion.. learned a lot. "]},
{"comment": ["yeah, much interesting and usefull information...not only for newbie)"]},
{"comment": ["Bitcoins are the virtual form of currency which are first introduced in the form of white paper."]},
{"comment": ["Bitcoin is a cryptocurrency created 8 years ago. It uses decentralised technology for secure payments and storing money that doesn't require banks or people's names. Now bitcoins are very popular. The future behind the crypto market."]},
{"comment": ["[/color]"]},
{"comment": ["Thanks, very helpful stuff."]},
{"comment": ["Bitcoin is pseudonymous, meaning that funds are not tied to real-world entities but rather bitcoin addresses. Owners of bitcoin addresses are not explicitly identified, but all transactions on the blockchain are public. In addition, transactions can be linked to individuals and companies through \"idioms of use\" (e.g., transactions that spend coins from multiple inputs indicate that the inputs may have a common owner) and corroborating public transaction data with known information on owners of certain addresses."]},
{"comment": ["BTC oldest and most popular crypocurrency now. "]},
{"comment": ["Have a look on cryptos.digital .. all about altcoins, crypto FAQ, Glossar and more "]},
{"comment": ["Try to work on the site Btcforex.org. Earn bitcoins easily."]},
{"comment": ["Wow, nice infographic!"]},
{"comment": ["BTC - Real and profitable crypto currency"]},
{"comment": ["Simple explanation of bitcoin "]},
{"comment": ["I know what BTC is but this video will be good and accessible explanation for my family"]},
{"comment": ["For those who use bitcoins, this is the method of investing, which is the most popular today. And for some people, it is something incomprehensible and unknown)"]},
{"comment": ["  Bitcoin is a story about freedom of money, since both these theses are most brazenly violated in this payment system. Bitcoin does not issue any of its administrative centers. New money appears in the system as a reward for those who managed to create a new block using the hash selection method (which is what it is - see below)."]},
{"comment": ["nicely presented article "]}
]