[
{"comment": ["I was asking myself how did I get into bitcoin and I took a little to remember."]},
{"comment": ["It was the summer of 2010. My friend asked me to look for information about overlay networks."]},
{"comment": ["     I saw a random thread posted on reddit, so I did some research and played around with it. I'm more interested in the trading aspect more then I am interested in mining bitcoins."]},
{"comment": ["Yeah, I haven't been mining lately, just trading..."]},
{"comment": ["I was reading a Wired article on Bitcoin and the Silk Road back in April 2011 or so. After that I started to look into Bitcoin a bit more and thought the concept of a cryptocurrency was pretty awesome. "]},
{"comment": ["I hazily remember something from early 2011, but I couldn't get the client to work and then bitcoin crashed and I lost interest. Then I returned in January 2012 upon seeing some article \"bitcoin alive and kicking\" on reddit and was hooked. I can't mine, I'd cook myself in this small flat "]},
{"comment": ["I heard about bitcoin from a friend. I have googled and found a plenty of info. At first I was sceptical, but I recently sold the ones I generated over a year ago, which turned the scepticism into takeaways "]},
{"comment": ["People at work talked about it, I spend a weekend studying it, bought and started using bitcoins the week after "]},
{"comment": ["I read about 'wikileaks' taking donation in bitcoin then 2-3 more sites so searched and got whole knowledge about it..."]},
{"comment": ["One day i read about tor , with tor i heard about bitcoin and try to find out what is bitcoin."]},
{"comment": ["Started discussing gold and silver with friends and noticed it's similarities to bitcoin.  Both are undervalued in my opinion."]},
{"comment": ["Just learned about it from a friend who'se building a mining rig."]},
{"comment": ["I can't remember EXACTLY, but I am pretty sure I just stumbled upon it. I think i got one of those GOOGLE NEWS emails and was bored, clicked, read, read some more.. i guess the rest is history."]},
{"comment": ["My favorite NZB site was shut down and I wanted to join and the only form of payment they took, was BTC. I was thinking what the hell is BTC and how do I get some. Mining hashing, it just seemed weird. Finally figured out how to buy some and paid 60 for about 10btc. Lost interest till the big rise and my wallet that was worth about 20 buck was now worth about 400. Now a year later I hares in three mining companies, and mine on a small scale with 1 7970 and 5 Block Erupters using MinePeon on a R Pi."]},
{"comment": ["I was actually searching for a casino website which leads me to bitcoingg and through then I've tried to research about bitcoins and got interested with the p2p transaction also googling it and find some source at reddit  "]},
{"comment": ["actually a friend told me about that early this year ^^ since then i started to collect bitcoins and bought from a website a butterflylab 50ghs bitcoin miner... didnt wanted to purchase it on the official butterflylabs site because of the long shipping time  "]},
{"comment": ["I was asked to participate in a currency assignment in my economics class. Bitcoin looked interesting, so I gave it a go. Come to find out, I'm diggin it!"]},
{"comment": ["I was told by a family member who had seen it  on the Keiser report. Max Keiser is big on publising BTC"]},
{"comment": ["I found out about it online, I was browsing and saw news about this weird thing called bitcoin that you could buy stuff with and then found out I could actually earn a few from home, which at the time was awesome."]},
{"comment": ["I was contacted about a business that was focused on bitcoin for its main currency, commissions and new projects. Joined it and have made some bitcoin from it. It has since gone on to release several bitcoin related websites and is moving on to bigger projects. Early on it struggled because most people didn't know about bitcoin, including myself but things are looking good now. It has managed to give me several thousand dollars worth of bitcoin so I'm pretty happy with it all so far."]},
{"comment": ["I read about Btc this spring and forget it while this november. Currently I bought 0.079 Btc"]},
{"comment": ["I saw a yahoo news article about it. "]},
{"comment": ["Well i broke my bitcoin virginity today and am i the proud new owner of some btc "]},
{"comment": ["if you would ask me I would say that I go into bitcoin by chance, a rare coincidence when I downloaded the bitcoin app on my laptop and here we are today."]},
{"comment": ["It all started in 2011, on one of my favorite message board communities that I am a part of."]},
{"comment": ["Amazing!"]},
{"comment": ["I was introduced by a friend - and now ocassionally get paid to write up articles and do a bit of SEO and am paid in bitcoin. "]},
{"comment": ["Tody, I join in  "]},
{"comment": ["One of my friend told me then iş more focused."]},
{"comment": [null]},
{"comment": ["I searched for \"hardware assembly guide\" in my native language and got to the page BtcInfo.org or something"]},
{"comment": ["Got an investment guide email and checked it out.  Decided to give it a whirl. Anti-establishment money... who doesn't love that?"]},
{"comment": [null]},
{"comment": [null]},
{"comment": ["My friend told me to invest in Bitcoins in early stage and I'm glad I did. I should have invested more though..."]},
{"comment": ["My brother started mining litecoins about 3 months ago. Since he started he has built 10 mining rigs. He tried for two weeks to get me into it to no avail. Finally he decided to park two of his miners at my home. After watching the coins click into the bitcoin account I was hooked. Since then I have spent well over 100 hours researching cryptocurrency."]},
{"comment": ["I got into bitcoin at a fairly early stage, it was around 12 dollars for 1 BTC back then, and been hooked ever since."]},
{"comment": ["my friend was already mining, had 1 machine, bought more later. It was really interesting to listen how he trades his electricity to money."]},
{"comment": ["i found it on google news!"]},
{"comment": ["I get bitcoin 2 month ago from the largest indonesia comunity. I look that's very free, so I learn bitccoin who send free..."]},
{"comment": ["It was 1 year ago. My friend told me Bitcoin is a good business. That was like 30$ in that moment."]},
{"comment": ["A friend of mine was boasting that he earned about $1400 net on buying-selling bitcoins and I decided to try too))"]},
{"comment": ["Got tired of getting burned in the stock market, I mean even look at IPO's first dibs go to institutions and friends of company then enters public market at 200% premium on avg! \"equities are not rigged!\" lmao, right"]},
{"comment": ["I was told about bit-coin from a friend, he told me you could earn money this way and i just started. Hope i do get some money. Really need some help getting my life together.  "]},
{"comment": ["I wish I could give you a moment, but I started following it last year, and was hooked by the idea of a currency that banks, governments, and private interests could create, manipulate, or control."]},
{"comment": ["actually to substitute the overrated stocks for something thats not cash^^"]},
{"comment": ["For me, when bitcoin became popular in the gaming industry I become more eager to explore what bitcoin is, google and other advice from experts really helps me a lot to know more about it. As a result, we came up a new service which is Bitcoin as our new method gateways. Now Asianconnect is accepting bitcoin for betting on sports and casinos."]},
{"comment": ["I heard a news-item on the radio about a guy who remembered he mined some bitcoin a long time ago. He bought a house when he finally found the keys to it. Initially i was intrigued by the value increase, but became fascinated by the technology and the potential it has."]},
{"comment": ["I have learned about bitcoin from Internet. Now I practice this regulary here mining-profit.com"]},
{"comment": [null]},
{"comment": ["I found out about it early 2011.  Thought it was dumb.  Looked again and was hooked."]},
{"comment": ["I just thought it was a good opportunity to make a quick buck, but after dealing with it for almost a year and a half I kind of got obsessed with it "]},
{"comment": ["I can't give an exact day or time, or event that got me involved in Bitcoin."]},
{"comment": ["About Bitcoins I learned from my friend. He invited me to try. He advised mine bitcoin as I had a very powerful computer. I get Bitcoins for 4 years. History and information about the price of bitcoin I look on the mining-profit.com/bitcoin-price-chart. Used other sites but this one is for me the best."]},
{"comment": ["Just like that! "]},
{"comment": ["Hi! I learned about bitcoin only a half year ago from  a spam letter. I  googled and encounted  news about bankrupt of Mt.Gox exchange and other bad information,  so I decided to stay away from it but again another spam made me to reseach it properly and I learned that many people became rich with it and this coin appeared to be not a fake. From spam I came to real thing that brought me to altcurrency. "]},
{"comment": ["it seems most of us arrived to the party kinda little late, which is a shame!"]},
{"comment": ["I read a newspaper article about it, then I got addicted to it."]},
{"comment": ["Actually I was just looking for casino. .."]},
{"comment": ["I was doing research on a project that leads to another project."]},
{"comment": ["I came across bitcoin for the first time when i noticed many e-currency payment processors were using it for both funding and withdrawals and then i decided to check out what it is all about."]},
{"comment": ["just trading bitcoins .... really made some serious profit "]},
{"comment": ["I found a bitcoin tutorial on YouTube two years ago, and have been interested since."]},
{"comment": ["Summer of 2010. I was working for a friend. Bumped into bitcoin. First thought about it was : It was weak and suspicious. And then after 4 years, I AM HERE!"]},
{"comment": ["I heard about it 2 years ago from my superior..."]},
{"comment": ["Actually found out about it looking for MMOs to play when i had a patch of free time a while back, stubled upon a bitcoin based casino mmo, yeah not the normal type of game but there are facuets ingame and you can just play or level for fun (i.e no depo). Called dragon's tale."]},
{"comment": ["Hey guys! My name is Ilham. How didnt know bitcoin?... ) WHole Internet knows bitcoin..  Just someone`s finds this vista before anothers.."]},
{"comment": ["Heard about bitcoin when the price was ~700$"]},
{"comment": ["I got into Bitcoin by meeting other crypto enthusiasts at cryptotradenetwork.com."]},
{"comment": ["I was invited by a friend to meet an \"interesting\" person he knew. That person was Matt Scott a local programmer, "]},
{"comment": ["Its been about a year and a half for me. I got into it once i heard andreas antonopolus talk about it. He really understands the technology aspect and i could see the long term potential in it once i heard him speak about it. Then the price started skyrocketing, so i got involved. Now i believe in it reguardless of the price."]},
{"comment": ["heard about it a few years back, but really got into bitcoin two months ago.  Now I'm fully converted and preaching the gospel."]},
{"comment": ["Has anyone used bitcoin casino just out of interest? "]},
{"comment": ["Heard about it on the news, now writing a dissertation on it"]},
{"comment": ["My brother dan introduced me to bitcoin last though at first did'nt undestard anything"]},
{"comment": ["I was selling virtual goods and the buyer asked me if I accepted bitcoin, I had heard of it but never used it. Been using it since then."]},
{"comment": ["i am big into investing, so i thought i would give it a try and see what would happen.  I am still foreign to the ideas behind BTC though."]},
{"comment": ["From curiosity :-)"]},
{"comment": ["Im start a few weeks ago on Genesis Mining and i buy 400Gh/s for life time. "]},
{"comment": ["I read an article in October of 2013 about a Norwegian man’s $27 investment that turned into $886,000 in four years. As a finance major, I was intrigued by what kind of investment could produce these type of capital gains in such a short time period."]},
{"comment": ["I got into it when I first learned about the Deep Web. Specifically Agora & Evo. (When they were up and popular)"]},
{"comment": ["In march, 2013 I found an article about Bitcoin because the price boom(~100$). I start to researching right after and at that evening my gamer card started to mining. That was the beginning for me. For now? It's my life."]},
{"comment": ["I was going through some you tube videos when I saw this voice podcast with Reihan Salam and Jerry Bitto. They talked a lot about bitcoin and that was my first look at bitcoin"]},
{"comment": ["I have used this company coin.mx as an interest in the bitcoin revolution, so far for my Bitcoin play at different places and it is a very reputable establishment, so far they have made it easy to deposit as well as withdraw since I have been affiliated."]},
{"comment": ["How did I get into it? They started opening up BitCoin casino's. "]},
{"comment": ["I mined a bunch in 2010 after stumbling upon the whitepaper while reading activist forums. Later I threw away my wallet. It is gone."]},
{"comment": ["I heard about Bitcoin within the story about legendary pizza "]},
{"comment": ["Read a post on a forum that mentioned bitcoin, so I checked it out, that was in spring 2013, and I bought 1 bitcoin at that time"]},
{"comment": ["Eu li um artigo na revista Superinteressante em 2014, e acabei gostando muito e logo me interei  mais sobre o assunto e hoje o bitcoin está muito presente no meu dia a dia."]},
{"comment": ["i had heard it from a friend and he had made good money with it"]},
{"comment": ["I was told about it by my friend and I decided to check it out on the internet"]},
{"comment": ["I was doing a research about graphics card as well and while I was looking for a cheaper graphics card (as i'm in the middle of low-no money), I came across this site (or a blog. I can't remember much) that talks about the potential of bitcoin and that was years ago. I just then got hooked up but I stopped without knowing that it will come back to me sometime soon. I kinda felt the disappointment of not investing in it before but here I am!"]},
{"comment": ["in 2014 was see in internet... very intersting"]},
{"comment": ["i had heard it from a friend and he had made good money with it"]},
{"comment": ["I’m new to this forum will you tell me what is bitcoin? What is the purpose having this bitcoin?"]},
{"comment": ["I had followed it off and on through the 2011-2013 stages and dived in when the big price surge happened."]},
{"comment": ["Just got to the Bitcoin thing by a friend of mine."]},
{"comment": ["I heard about it back in 2010 (why didn't I buy?  WHY?!?!) but spark really got lit after a chat with co worker in December 2014.  Started reading a ton, writing some stuff, and before I knew it had enough content to launch my site. "]},
{"comment": ["To put it short, a friend gave me some bitcoins back in 2012, thinking they would soon die and be worth nothing. Guess he was wrong."]},
{"comment": ["the news... i see darkweb then look more into bitcoin"]},
{"comment": ["I've learned about it from colleagues and internet."]},
{"comment": ["Just from faucet.. and from other web(forum).."]},
{"comment": ["First i read a article about Bitcoin. It was amazing to know that we can make  much money by trading bitcoin. Basically i like to trade and i liked it . "]},
{"comment": ["well my boss told me and i start to search the history of it and i got curious on how it flows in the market and even got shocked of the rate per bitcoin."]},
{"comment": ["a friend tell me about it and i like it "]},
{"comment": ["Couple of months ago my friend told me about bitcoin. I started to read some information, but still quite new in this"]},
{"comment": ["Often seen it on different sites. Gradually, it got my attention, and here I am! I'm newbie to this system. But I'm still newbie to this system."]},
{"comment": ["Well, i m into IT business and once i have client who looking to make the site for bitcoin related ...to listen the word is very interesting ... i dont know anything before it ...i read over internet for a week for this and come to know few things from... as time go i started taking more interest with this ..... and after a months study i just join today for the bitcoin knowledge"]},
{"comment": ["A regular customer at our local liquor store in Paris almost 2 years ago was a super smart internet wiz. He suggested we should start accepting bitcoin to stand out and make headlines. We are slowly expanding to internet sales more and more each month."]},
{"comment": ["i get into bitcoin with a help from a friend she explained everything...almost i need to learn more "]},
{"comment": [null]},
{"comment": ["For me I got started earlier this year after a friend mentioned it a couple of time ever since I've tried mining trading playing games(alot), and its been a cool ride and well worth the experience, I've recently been inspired by bitcoin as it looks like there's a lot of opportunities for it in creating better crowdfund and payment platforms especially in the gaming area, not just flash but also mainstream."]},
{"comment": ["I earned my first bitcoin thru faucets. I was unaware the possibility of earning so much cash in bitcoins way back 2013, so I decided to quit halfway. And then that BOOM happen at the end of the year 2013. The price of a bitcoin was around $1k that I regretted ignoring the fact bitcoins can give me much money."]},
{"comment": ["I just got into Bitcoin this year with faucets."]},
{"comment": ["I read about an anonymous currency that were based on the internet. It was unbreakable and could send value to anyone in the world within seconds. I fell in love directly."]},
{"comment": ["Hi there every one please secure your account at (ore-mine.org)because there some  hackers attack on your account and withdrawl your all amount "]},
{"comment": ["Stupidly scoffed at the idea when it first came out years ago, now feel like a dumb ass getting into it a little late. I occasionally do a couple faucets throughout the day just for the hell of it, and I buy small amounts as I can afford to between rent and bills. Currently trying a cloud mining service and *hoping* it's not just scam crap. Tried selling an old *working might I add* Apple IIe here on the forums, but doesn't seem to be any interest in old nostalgic computers. Personally I love the old stuff, don't really want to part with it, but now I see the value of bitcoins is probably a little more worth selling it than keeping it. "]},
{"comment": ["My friend advised me this forum"]},
{"comment": ["A friend asked me if I had a BTC address, that's how I got into bitcoin."]},
{"comment": ["I googled \"How to make money with my Pc\" and boom - Bitcoin "]},
{"comment": ["Hi."]},
{"comment": ["I get into bitcoin for business! for the investment in MMM global which is  a business investment platform."]},
{"comment": ["I wanted to get into day trading and was reading an article about trading at Starbucks when I heard a girl mention that she paid with bitcoin. I've heard about how volatile bitcoin is and thought it would be a fun way to get into trading at a very low cost."]},
{"comment": ["I was looking for cool digital innovations and saw it before it became mainstream currency. "]},
{"comment": ["Honestly I think I heard about a game called coinbrawl on reddit. From there I signed up created my first bitcoin wallet and have been dabbling in bitcoins ever since. I've since started investing in p2p lendings sites, created a faucet list, rotator, and my very first website from scratch. Hoping to get my faucet funded and off the ground at the start of the new year."]},
{"comment": ["My interest in bitcoin only took hold 4 months ago.  Now I'm retired I was looking for an activity that would interest me.  I remembered looking up bitcoin on the net when I was still working in 2010.  At the time I did nothing, but now I am retired I spend my on-line time visiting faucets and researching cryptocurrency in general.  While I think about it, what would be a cryptocurrency that would be worth accumulating in tandem with bitcoin? "]},
{"comment": ["bitcoin was referred to me by my friend for exchanging purpose so i got into it and now became successful bitcoin seller in very short period of time just because i am honest with my dealing."]},
{"comment": ["i am got this forum at another website"]},
{"comment": ["I search for earn free money app. I saw an app give free bitcoin. It is easy to earn free bitcoin "]},
{"comment": ["A work friend was telling me about something that ran on a computer and looked like usb flash drives with lights blinking and that this person was making money at it, he didn't want to tell him what it was because if everyone knew then the price of equipment would become more expensive and everyone would do it."]},
{"comment": ["As a person who is more dedicated to research work, never overwhelm in discovering any gateway or forum. I came across it when I was sourcing best ICT learning forum "]},
{"comment": ["Doing Affiliate and referral marketing. Got good income with BTC. I use this too get bitcoins with little efforts."]},
{"comment": ["By using faucets like these two [EDITED]. [EDITED]."]},
{"comment": ["We just started taking bitcoin so i am still learning to ropes on what you can and cant do with it."]},
{"comment": ["Faucets and cloud mining"]},
{"comment": ["I got into bitcoins when my friend told me that he won a bitcoin worth of $200 way back 2013 in a faucet website. At first,I thought he was kidding because it is only by chance and it would take a lot of time just to gamble getting free bitcoins but guess what? I visit the website that he recommended (faucet website) and my first roll was worth around $50! Then I guess that is the start of my interest into bitcoin world."]},
{"comment": ["for the first time I´ve heard about bitcoin in autumn 2010.....what a pitty that I didn´t buy some BTC in that time:)"]},
{"comment": ["Ha i first got into bitcoin many years ago after looking for some way to transfer webmoney ,never did find a way that i trusted to do wmz to bitcoin dont know about now its probably easier,but it made me look into bitcoin and the more i looked the better i thought it was as a solution to online payments,so i started using it mainly to pay for online gaming and since there are lots of places you get it for nothing more than a few clicks it was perfect,saves me digging into my own pocket and since i am a bit of a surfing nut i kind of like searching through all the faucets,the good news as i see it is there is about to be a shift from boring plain old style faucets to more with a design element to them and even some are moving towards having a social element with chat boxes and forums."]},
{"comment": ["Simple! I just Google it the information about bitcoin exchange and it’s process. Added in twitter I just started to follow some experts in bitcoin exchange. And then I kick started the bitcoin exchange trading."]},
{"comment": ["I have a friend, who is dealing with Bitcoins since I know him. I was always very curious about what he is doing, what that \"Bitcoin\" actually is...after a while he formed a startup company and invited me to join. I started to dig in a bit deeper and realized that this geeky invention called Bitcoin is not that geeky at all and which is more - it`s actually something I always hopped to happen...an alternative to \"almighty\" bank system. "]},
{"comment": ["I got into it through playing poker for bitcoins. Great way to build up a bitcoin investment too! (if you're any good, that is "]},
{"comment": ["Back in 2011 I was introduced to Bitcoin by some computer games entrepreneurs. I spent a couple of late nights reading the theory and got hooked enough to send a €5000 wire to MtGox. Got a few hundred coins for $16 and held them even though price crashed to $1. Still a hodler."]},
{"comment": ["Hi I just Started Today. Can Anyone be kind enough to transfer some bitcoins so i can experience joy of bitcoin. "]},
{"comment": ["You will find it hard to convince anyone to just send you coins. You can easily buy some at localbitcoins.com"]},
{"comment": ["i saw an article about bitcoin in 2011, that's how i first heard about it."]},
{"comment": ["How to get bitcoin? i think get bitcoin very hard"]},
{"comment": ["It was so so confusing topic for me. I couldn't imagine how Bitcoin is working. By the way friend of mine introduce me Bitcoin throuth this website: techcoins.net "]},
{"comment": ["I cannot remember clearly but it seems that one of my fd dragged me to the anx..."]},
{"comment": ["I joined last year Asia Expo in Singapore and get some understanding. I also registered an BTC debit card from ANX. then i trade BTC by that."]},
{"comment": ["I am going to join this year's"]},
{"comment": ["Bitcoin and Blockchain are already part of your life. Dave Ripley on Futures Radio Show – 5.12.16"]},
{"comment": ["I started with curiosity after watching its price graph"]},
{"comment": ["Bitcoin works via something called the block chain. Every time you do a transaction, it gets included in a block and every 10 minutes or so, that new block gets accepted into the stack of blocks called the block chain."]},
{"comment": [null]},
{"comment": ["Mostly because \"Black Friday\"."]},
{"comment": ["i was first introduced to Bitcoins back in 2010 via a random article."]},
{"comment": ["first heard about it when the crash happened in 2014 or something. "]},
{"comment": ["I heard it is a solid payment option and I found out it is tradable and exchangeable for other coins."]},
{"comment": ["My friend had to give me money so he told me to take bitcoin.At that time btc rate was low and i regret for not taking it."]},
{"comment": ["It was two years ago, my best friend after a long discussion about my problems with my boyfriend at the time, said to me that I can pay him with bitcoin for his service "]},
{"comment": ["I was bored and browsing some random forums and for some reason I ended up reading about bitcoins. lol"]},
{"comment": ["I am an Internet Marketer i used to make online payments on regular basis, I use paypal, Payoneer, Instamojo to send or get payments now i heard about bitcoins through my friend who is also an internet marketer. "]},
{"comment": ["and it has changed the world!"]},
{"comment": ["I first got astonished by sky-rocketing prices of Bitcoin. Studied a bit to understand that it is a real money and independent of government approval, what gives people freedom from the money-policies (inflation, deflation, recessions, depressions) and allows an allows sound economics and prosperity. Next step was start trading. But I got interested on the background of the trading systems and decided to join a team to construct our own trading company. And we just launched the company few days ago. We intend to be the lowest fees worldwide (during first months it is completely free). I will do a different post to set the official announcement. By now it is enough to give you the site address. Crypto-Trade.net I hope you all enjoy it."]},
{"comment": ["I saw a lot  of tittle about of bitcoin.And i saw btc on tv programme,they was talking about bitcoin and bitcoin future.Than i signing up."]},
{"comment": ["I heard about it online and joined. "]},
{"comment": ["Only yesterday but I had scam my bitcoin is gone.. So that I start today. "]},
{"comment": ["We migrated from Forex and payment services"]},
{"comment": ["I thought that I start to invest money for retirement and I'm just considering various options;)"]},
{"comment": ["I asked for something, some way to fund budget"]},
{"comment": ["I read an article on the internet."]},
{"comment": ["I occasionally heard about it on some news site. Opened bitcoin.org and after a couple of minutes closed it because I couldn't understand what's the use of bitcoins. Later in Nov, 2014 I greedily bought $20"]},
{"comment": ["hmmm.... Lemme check, I was pregnant that day with my daughter was looking for something to meddle since I was planning that once she's out of this world I'll stay home and take care of her while working at home at the same time. While I was searching for a flexible hours of home-based work I ran into Coins.ph and started to take the advantage of it's features which is the buying or loads to all networks, pay bills, and money remittances which is by the way works for me cause I don't have to go out my house and fall in line or rode a public transportation. IT's just a few clicks or tap of my phone. (Philippines only)"]},
{"comment": ["i also curious about how to get it"]},
{"comment": ["i get to knw bitcoin through a gambling company but havent started using bitcoin."]},
{"comment": ["through a faucet site and affiliate site"]},
{"comment": ["I was late in the game..got my first coins after DPR's arrest and Silk Road's fall.  I believe it is the future of P2P payments, as long as we spend and don't hoard.  Peace."]},
{"comment": ["I am just learned it from my friends."]},
{"comment": ["Well i have hear from my friends about bitcoin, then i started to get more info about it, and after all that i decided what cryptocurrency its a nice stuff!!"]},
{"comment": [null]},
{"comment": ["I don't remember the year, probably 2010, but I saw a post about it in some Linux forum and started poking around.  I decided to buy some but it was impossible.  There were a bunch of sites that offered them for sale in currencies other than USD, but nothing I had.  And the BitcoinFaucet had run dry by then."]},
{"comment": ["Libertarian politics. That's how a lot of people got into it."]},
{"comment": ["Everything started by reading an article about people creating money by configuring a PC to mine. Sounded kinda crazy, so I continued to read... "]},
{"comment": ["I got introduced to it by reading forbes! I love reading and that article changed my life. "]},
{"comment": ["Just browsing the net and reading about it It was fascinating.I forgot all about it,until recently a friend mentioned it.I then decided to give an attention once more."]},
{"comment": ["Found it fascinating at first then started affiliating in bitcoin industry"]},
{"comment": ["As we know there is a difference in buying price of bitcoins in US and India. Can any one buy it at lower price from US and sell it at higher price in India or there are some transaction fee / other charges are involved?"]},
{"comment": ["hello am new here please can someone explain what is going on here for me?"]},
{"comment": ["My friends told me about bitcoin on how it can help people to earn extra money but it pretty difficult because it needs effort and time."]},
{"comment": ["Just learned about it from a friend who use ptc sites."]},
{"comment": ["It was 2009 I believe and I found out about it via reddit.  I didnt know much about it but was interested.  I missed the boat by a few years bc I was afraid to invest my money into it when it was $1 to $3 a coin.  I could be living in a house right now from BTC but I fucked up.  O well, now I just wanna invest a lil money every week from work into it for future investments to get thru life"]},
{"comment": ["Well it was 2013 when I first time started to use bitcoin, it was booming and I was in hosting business, I decided to accept it so I can increase my client base."]},
{"comment": ["Hey all!  I'm new to forums so hopefully I'm doing this right!"]},
{"comment": ["I was watching tv drama and one of its episode was about bitcoin. That sounded so fresh and new to me and i started to research about bitcoin.."]},
{"comment": ["Hey guys "]},
{"comment": ["I got into bitcoin because it became profitable again to set up a mining rig at home. Now all I do is search the internet for new Radeon cards and add to my collection."]},
{"comment": ["Я начал пользоваться биткоин, потому что он вырос и я получил возможность заработать деньги."]},
{"comment": ["I heard that my friend made $1k in 2 weeks, so since then I started being interested in cryptocurrencies."]},
{"comment": ["I wanted to earn more money, and bitcoin was introduced to me."]},
{"comment": ["I firstly heard bitcoin from a friend years ago. He keep saying that it will be boomed in the next few years. I ignored him that looks like he is dumb. But I was wrong  "]},
{"comment": ["I mine btc)"]},
{"comment": ["The day I was introduced to this website was when I get to start with bitcoin and I have started making bitcoin since then over and over again. Get into the trending market of bitcoin and take advantage of a community of people helping each other growing their bitcoin by 100% within days. Register, provide assistance through bitcoin to those in need and you get assistance by others and get your 100% of assistance you provided back in few days. Just visit their website globalassistance(dot)biz "]},
{"comment": ["Similar. A friend of my mentioned it via Skype and then I started researching and it seemed big."]},
{"comment": ["I decided to earn some money on the growth of Bitcoin. My friend who did this already had a condition advised me this wallet "]},
{"comment": ["From Google  ...I got this forum ......"]},
{"comment": ["I got to know about it through a friend "]},
{"comment": ["Hi. This is the first replay I make on this forum but um to answer that question. I recently noticed what bitcoin was by the way through the news paper. "]},
{"comment": ["I had heard about it in the early days of mining, but lost interest when the costs outweighed any profits. Came back after hearing marketplaces accepting btc payments. If I had only bought a coin then....  "]},
{"comment": ["in telegram chanel i just heard about tokens bounty.. i registred there, then begin to learn that theme about cryptomoney and then registered my firest BTC wallet "]},
{"comment": ["I am a huge fan of Youtube. I just was jacking around many youtube channel and found video about Bitcoin. and I was really interested in it."]},
{"comment": ["26th March 2016 - that is when I first heard about Bitcoin. Someone who was associated with a company which was into Bitcoin Mining and was promoting itself through MLM and networking approached me telling the concept of Bitcoin and story of Satoshi Nakamoto.  Initially it appeared a ponzi scheme and a kid's story but as I realized the potential of Bitcoins I got deeply interested into it. That time I was trying to learn blogging. As this topic of Bitcoin got me interested I started reading and writing about Bitcoins. Soon I had a blogsite : infoaboutbitcoins dot com, where I wrote basics about Bitcoins for learners. To this day I am so fond of Bitcoins. My first purchase was on 26th March 2016 when bitcoin was less than $450 and today its five times more over a period of little over an year."]},
{"comment": ["What do you mean how?? all my friends around me were investing to BTC. I couldn't just sit down and watch them getting a rich without any efforts."]},
{"comment": ["At my working place, my boss has been talking about bitcoin lately. He was saying how much money he earned out of what he invested. And that kind of sounded a lot of money he earned. So I started getting interest on this."]},
{"comment": ["I wish I would have gotten into Bitcoin at 2009 :/"]},
{"comment": ["I heard about bitcoin i think in 2011 when everthing was just at the beginning..."]},
{"comment": ["Yes, sell, sell, sell!"]},
{"comment": ["I got into it in 2015 when one of my friend introduced me to the world of online investments and came across this beautiful system of crypto world. It was very difficult for me to accept it at the beginning but now I am happy I am into this boat at the early stage."]},
{"comment": ["I remember about a year and a half ago, a revenuehare company started with the bitcoins. "]},
{"comment": ["Hello! I am not yet been in bitcoin. But i want start it. Can you give some advise so how to find investors or miners? "]},
{"comment": ["I'm pretty shure I've heard about it from my friend or my co-worker. At first I wasn't interested but a little bit later somehow I googled and started reading a lot about it."]},
{"comment": ["And what did you learnt? Like some basics things to do"]},
{"comment": ["im know bitcoin from internet when im googgling and fell in loved since then."]},
{"comment": ["because of pluggle i search about bitcoin.. and ive been seeing the word bitcoin in facebook and got curious.. "]},
{"comment": ["While im surfing on internet, i saw some article about this bitcoin and it get me to be interested."]},
{"comment": ["i get when know about ico"]},
{"comment": ["I got into bitcoin because my friend told me that it is a very good income and profit nowadays. My friend told me that he got a lot of bitcoin money through posting and answering the different types of topics. It is very convenient and easy to do that's why I get interested in bitcoin and started to do it"]},
{"comment": ["a lot of my on facebook posting a lot of bitcoin stuff specially charts. Eventually I bought my first bitcoin last may 2017 and started trading via poloniex and bittrex"]},
{"comment": ["I was looking to earn money online always aware of all the ecurrencies. then i heard of bitcoin p2p new currency was fascinating new currency. i started to get into bitcoin now i am earning only with crypto currency trading and mining."]},
{"comment": ["Ohhh I even can't remmember that "]},
{"comment": ["I was talking to my friends who were sabby when it comes to internet, and they firstly told me to try these online forum.Then, I started reading some articles about BTC.. then I found myself registering. I am fascinated on how these system works.."]},
{"comment": ["My friend ask me to help him bough a rig for mining."]},
{"comment": ["I was introduced to cryptocurrency by one of my friends who was trading crypto at the time."]},
{"comment": ["I can't say, that I already \"get into\", I'm at the process still, but the life always get me to find the alternative ways of making money"]},
{"comment": ["my friend told me about bitcoin some people didn't get it this bitcoin other said its scam and wasting time spending a lot of money but other people spend time for how to be use bitcoin wisely the other side use bitcoin to gambling site always lose them."]},
{"comment": ["My collegs tell me about it this Spring and I start learn it, now I have BTC on my wallet and will keep it"]},
{"comment": ["It was a long time ago, I accidentally stumbled upon information about bitcoins. I became interested and began to study this topic."]},
{"comment": ["hi everyone how ru?r "]},
{"comment": ["I asked an economist friend if he has any investment ideas "]},
{"comment": ["Good bitcoin forum"]},
{"comment": ["Read some information about bitcoin about 2013, but was not too interested. really wished I bought back then."]},
{"comment": ["Of course read about it in news and bought my first 4BTC for $4000."]},
{"comment": ["I got into bitcoin totally by accident by now I just love it "]},
{"comment": ["Neowebwallet : I was asking myself how could I get into bitcoin and I took a little to recollect. The absolute starting point was the point at which I was going to purchase a realistic card ."]},
{"comment": ["At first time it was at my work - my friend investor in BTC and he tell me about it"]},
{"comment": ["I heard internet money back in 2013, started mining a bit.. but saw it wasn't very profitable for my machine at the time so forgot about it for a few years. If I had only stuck with it.."]},
{"comment": ["gift "]},
{"comment": ["I was introduced to bitcoin when a business colleague attended a blockchain summit conducted in Dubai "]},
{"comment": ["herkese merhaba"]},
{"comment": ["It was 2013."]},
{"comment": ["I first heard it in early 2011. Did not attach importance to this, and only in 2016 when it gained momentum and almost all talk about crypto and bitcoin, I began to study it in more detail and even invested"]},
{"comment": ["I do not remember exactly when I began to study the topic of crypto currency, but I started investing quite late, only at the beginning of the summer 2017"]},
{"comment": ["nothing special"]},
{"comment": ["I unfortunately never got in nick of time, but I am not regretting it. I have managed to make up for it with options like Ethereum and others. I am even targeting upcoming ICOs, and that’s where "]}
]